tutorials/movingMeshRhoPimpleFoam/rhoPimpleArbitraryFoamCyclic/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    sides
    {
        type            fixedValue;
        value           uniform 0;
    }
    sides
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
600
(
6.92939e-310
6.92939e-310
0
0
293.15
293.15
293.15
293.15
...
)
;
    }
    outlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
15
(
0
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
)
;
    }
    bottom
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
20
(
0
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
293.15
)
;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
15
(
0
4.22974e+180
7.27166e+228
2.63125e+233
6.46578e+170
8.8196e+199
1.07332e+200
3.35942e+194
1.35788e+31
2.90944e+79
1.68202e+166
1.06482e+228
7.67575e+170
1.67338e+65
3.38202e-317
)
;
    }
}


// ************************************************************************* //
