tutorials/movingMeshRhoPimpleFoam/rhoPimpleArbitraryFoamCyclic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    sides
    {
        type            patch;
        physicalType    patch;
        nFaces          600;
        startFace       9404;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       10004;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          15;
        startFace       10024;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       10039;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          15;
        startFace       10059;
    }
)

// ************************************************************************* //
